Courses/4420/Lectures/Hardening/SecureKernel/kernel-lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-13 Sun 13:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab on Kernel Hardening</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">Lab on Kernel Hardening</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4c0ee3">1. Background</a></li>
<li><a href="#org66cdff5">2. Tasks</a>
<ul>
<li><a href="#org7b13f22">2.1. Task: Kernel with No-SELinux [20 points]</a></li>
<li><a href="#orga064b01">2.2. Task: Kernel with No-AppArmor [20 points]</a></li>
<li><a href="#orge577e9f">2.3. Task: Devious Kernel [20 points]</a></li>
<li><a href="#org808dabd">2.4. Task: Kernel Built by LLVM [20 points]</a></li>
</ul>
</li>
<li><a href="#orgfeac7ac">3. Submission</a></li>
<li><a href="#orga2e8772">4. References</a></li>
<li><a href="#orge1aae76">5. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge4c0ee3" class="outline-2">
<h2 id="orge4c0ee3"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Prerequisite:: Successful completion of SysCalls lab.</li>
<li>Prerequisite:: Apply all known patches for security.  <a href="http://www.linuxsecurity.com/">http://www.linuxsecurity.com/</a></li>
<li>Prerequisite:: Build a kernel yourself.  Be fully conversant with
creating a <code>.config</code> file.</li>
<li>Admitted:: We do not know deep-enough about the OS Kernels in
general, and Linux Kernel in particular.</li>
<li>Goal:: Even so, we can successfully build and deploy a secure
kernel.</li>
<li>Awareness:: On my Kubuntu system, <code>grep apparmor /proc/kallsyms |
   wc -l</code> produces 80, and <code>grep selinux /proc/kallsyms | wc -l</code>
produces 288.  Check your system.</li>
</ol>
</div>
</div>

<div id="outline-container-org66cdff5" class="outline-2">
<h2 id="org66cdff5"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>In each task, you are expected to build, document your build,
deploy, and demo the deployed kernel.  All of these should be
thoroughly described in the report.</li>
</ol>
</div>


<div id="outline-container-org7b13f22" class="outline-3">
<h3 id="org7b13f22"><span class="section-number-3">2.1</span> Task: Kernel with No-SELinux [20 points]</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Include AppArmor, Exclude SELInux.  Show that <code>grep selinux
   /proc/kallsyms | wc -l</code> comes out as (near) zero.</li>
<li>Provide 5 extra slots for new syscalls in the sys-call-table</li>
</ol>
</div>
</div>


<div id="outline-container-orga064b01" class="outline-3">
<h3 id="orga064b01"><span class="section-number-3">2.2</span> Task: Kernel with No-AppArmor [20 points]</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Exclude AppArmor, Include SELInux.  Show that <code>grep apparmor
   /proc/kallsyms | wc -l</code> comes out as (near) zero.</li>
<li>Provide 5 extra slots for new syscalls in the sys-call-table</li>
</ol>
</div>
</div>

<div id="outline-container-orge577e9f" class="outline-3">
<h3 id="orge577e9f"><span class="section-number-3">2.3</span> Task: Devious Kernel [20 points]</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Build a devious kernel that does contain known bugs.  We
expect to use such kernels in labs.</li>

<li>Focus on PIE (Position Independent Code).  See the references.</li>

<li>Write a users' manual.</li>
</ol>
</div>
</div>

<div id="outline-container-org808dabd" class="outline-3">
<h3 id="org808dabd"><span class="section-number-3">2.4</span> Task: Kernel Built by LLVM [20 points]</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Build the "No-SELinux Kernel" above with <a href="http://llvm.org/docs/">LLVM</a>, an alternate C
compiler and build system.</li>

<li>Demonstrate that you are conversant with Unit tests for known LLVM
Linux Bugs.  Study <a href="https://blog.regehr.org/archives/1450">https://blog.regehr.org/archives/1450</a> Testing
LLVM.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgfeac7ac" class="outline-2">
<h2 id="orgfeac7ac"><span class="section-number-2">3</span> Submission</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>[15 points] Lab Report quality, compliance, and completeness.  [5
points] Include a journal. By the hour.  You must follow the Lab
Report Template.  There should be a section on each of the tasks. A
couple of lines of an answer to each (implied/ explicit) question/
discussion item. Must number them as in this document.</li>

<li>Use good judgment in (i) what to submit and (ii) what to omit and
(iii) how long the report becomes.  Do not make the report way
longer than, say, 20 pages.  It is possible to remain under 20 pp, and
receive full score.  Lack of judgment earns <b>negative</b> points.</li>

<li>Submit relevant files of source code that you wrote, and of text.
Always interpret the results.</li>

<li>Submit a PDF file named exactly <code>Report-L7.pdf</code>, and a tarball
<code>L7.tbz</code> [created with <code>tar cfjvv L7.tbz source-files*</code> ]. (Scripts
are used to check various things &#x2013; so file names should obey such
"rules".)</li>
</ol>
</div>
</div>

<div id="outline-container-orga2e8772" class="outline-2">
<h2 id="orga2e8772"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Prabhaker Mateti, Lecture Notes on <a href="../SecureKernel">Linux Kernel Hardening</a>, 2018.</li>

<li><a href="https://www.vulnhub.com/">https://www.vulnhub.com/</a> "To provide materials that allows anyone
to gain practical hands-on experience in digital security, computer
software &amp; network administration. "  Required Visit.</li>

<li>PIE (Position Independent Executables) Exploit <a href="https://nvd.nist.gov/vuln/detail/CVE-2017-1000253">https://nvd.nist.gov/vuln/detail/CVE-2017-1000253</a>
Awareness Reference</li>

<li><a href="https://llvm.org/devmtg/2012-04-12/Slides/Mark_Charlebois.pdf">https://llvm.org/devmtg/2012-04-12/Slides/Mark_Charlebois.pdf</a> 30+
slides. 2012.  Compiling Linux with LLVM.  Awareness Reference</li>
</ol>
</div>
</div>



<div id="outline-container-orge1aae76" class="outline-2">
<h2 id="orge1aae76"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-11-28
</div>
</body>
</html>
